todo.org
#+title: TODOS

* *Known* Bugs/Issues
** TODO Fix displayed video duration on embeds to be more precise (e.g currently a video of duration 6:01 will be displayed as 6:1
** HOLD Currently the bot will not work on python versions > 3.12 as a dependancy of discord (audioop) has not been ported to work with python 3.13 quite yet

* Minor fixes/improvements
** DONE Make sure that all commands make use of discord guilds as to not create conflicts when the bot is in use in other servers. <2024-10-14 Mon>
CLOSED: [2024-10-05 Sat 22:08]
** TODO Switch the default downloaded filename of all downloaded songs to the title of the song (currently is set to the id as to not conflict with file naming conventions)
** DONE Add comandline options to specifically disable the loading of certain cogs
CLOSED: [2024-10-06 Sun 12:55]

* Major Features
** TODO Add playlist support
*** TODO Attempt to add support for spotify urls (may not be feasible if against TOS)
** TODO Add a search functionallity for already downloaded/cached songs *This depends on changing the file names*
** TODO Add a meme command that runs ever 30 or so minutes (reddit is no longer viable due to the API $$$ alternative could be lemmy or some other fedderated service)

