todo.md

# Table of Contents

1.  [**Known** Bugs/Issues](#org6b5a018)
    1.  [Fix displayed video duration on embeds to be more precise (e.g currently a video of duration 6:01 will be displayed as 6:1](#orga4ddae6)
    2.  [Currently the bot will not work on python versions > 3.12 as a dependancy of discord (audioop) has not been ported to work with python 3.13 quite yet](#org6eabd8e)
2.  [Minor fixes/improvements](#org4fff3f6)
    1.  [Make sure that all commands make use of discord guilds as to not create conflicts when the bot is in use in other servers. <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-10-14 Mon&gt;</span></span>](#orgd78704a)
    2.  [Switch the default downloaded filename of all downloaded songs to the title of the song (currently is set to the id as to not conflict with file naming conventions)](#org62a6a7d)
    3.  [Add comandline options to specifically disable the loading of certain cogs](#orgfda4ab9)
3.  [Major Features](#orgd302339)
    1.  [Add playlist support](#orgcdb3cdb)
        1.  [Attempt to add support for spotify urls (may not be feasible if against TOS)](#org34a13e9)
    2.  [Add a search functionallity for already downloaded/cached songs **This depends on changing the file names**](#orgc1d85ef)
    3.  [Add a meme command that runs ever 30 or so minutes (reddit is no longer viable due to the API $$$ alternative could be lemmy or some other fedderated service)](#org9f67ed7)



<a id="org6b5a018"></a>

# **Known** Bugs/Issues


<a id="orga4ddae6"></a>

## TODO Fix displayed video duration on embeds to be more precise (e.g currently a video of duration 6:01 will be displayed as 6:1


<a id="org6eabd8e"></a>

## HOLD Currently the bot will not work on python versions > 3.12 as a dependancy of discord (audioop) has not been ported to work with python 3.13 quite yet


<a id="org4fff3f6"></a>

# Minor fixes/improvements


<a id="orgd78704a"></a>

## DONE Make sure that all commands make use of discord guilds as to not create conflicts when the bot is in use in other servers. <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-10-14 Mon&gt;</span></span>


<a id="org62a6a7d"></a>

## TODO Switch the default downloaded filename of all downloaded songs to the title of the song (currently is set to the id as to not conflict with file naming conventions)


<a id="orgfda4ab9"></a>

## DONE Add comandline options to specifically disable the loading of certain cogs


<a id="orgd302339"></a>

# Major Features


<a id="orgcdb3cdb"></a>

## TODO Add playlist support


<a id="org34a13e9"></a>

### TODO Attempt to add support for spotify urls (may not be feasible if against TOS)


<a id="orgc1d85ef"></a>

## TODO Add a search functionallity for already downloaded/cached songs **This depends on changing the file names**


<a id="org9f67ed7"></a>

## TODO Add a meme command that runs ever 30 or so minutes (reddit is no longer viable due to the API $$$ alternative could be lemmy or some other fedderated service)

